agrondpham/lpc1764-sdcard/KHNLPC1764/src/main.c
}
void UART0_IRQHandler(void) {
	uint8_t IIRValue, LSRValue;
	uint8_t data;
	unsigned char trangthai_gui;
	IIRValue = LPC_UART0 ->IIR;
	IIRValue >>= 1; /* skip pending bit in IIR */
	IIRValue &= 0x07; /* check bit 1~3, interrupt identification */
	if (IIRValue == IIR_RLS) /* Receive Line Status */
	{
		LSRValue = LPC_UART0 ->LSR;
		if (LSRValue & LSR_RDR) /* Receive Data Ready */
		{
			data = LPC_UART0 ->RBR;
			//UART2_Sendchar(temp);
		}
	} else if (IIRValue == IIR_RDA) /* Receive Data Available */
	{
		//sprintf(tempValue,";%d",flag_gprs.send_gprs_ok);
		//UART2_PrintString(tempValue);

		data = LPC_UART0 ->RBR;
#if _DEBUG==1
		//UART2_Sendchar(data);
		UART3_Sendchar(data);
#endif
		if (data == 0x0A) {
			if (flag_system.start_rx_gsm == 2) {
				rx_buffer0[rx_gsm_index] = NULL;
				process_gsm_data();
				rx_gsm_index = 0;
				flag_system.start_rx_gsm = 0;
			} else if (rx_gsm_index == 0)
				flag_system.start_rx_gsm = 1;
			else if (rx_buffer0[0] == '+' && rx_buffer0[1] == 'C'
					&& rx_buffer0[2] == 'M' && rx_buffer0[3] == 'G'
					&& rx_buffer0[4] == 'R')
				flag_system.start_rx_gsm = 2;
			else {
				rx_buffer0[rx_gsm_index] = NULL;
				if (rx_buffer0[0] != NULL ) {
					process_gsm_data();
					rx_gsm_index = 0;
					flag_system.start_rx_gsm = 0;
				} else {
					flag_system.start_rx_gsm = 1;
				}
			}

		} else if (flag_system.start_rx_gsm != 0 && data != 0x0D) {
			rx_buffer0[rx_gsm_index] = data;
			if (++rx_gsm_index >= gsm_bufferLen) {
				rx_gsm_index = 0;
				process_gsm_data();
				flag_system.start_rx_gsm = 0;
			}
		}

	}

}

void UART1_IRQHandler(void) {
	uint8_t IIRValue, LSRValue;
	uint8_t data;
	IIRValue = LPC_UART1 ->IIR;
	IIRValue >>= 1; /* skip pending bit in IIR */
	IIRValue &= 0x07; /* check bit 1~3, interrupt identification */
	if (IIRValue == IIR_RLS) /* Receive Line Status */
	{
		LSRValue = LPC_UART1 ->LSR;
		if (LSRValue & LSR_RDR) /* Receive Data Ready */
		{
			data = LPC_UART1 ->RBR;
			//UART2_Sendchar(temp);
		}
	} else if (IIRValue == IIR_RDA) /* Receive Data Available */
	{
		data = LPC_UART1 ->RBR;
		//UART2_PrintString("?");
		if (flag_system.request_data) {
			if (data == '$') {
				flag_system.start_rx_gps = 1;
			} else if (data == '*') // && flag_system.start_rx_gps
					{
				flag_system.start_rx_gps = 0;
				rx_buffer1[rx_wr_index1] = NULL;

				if (rx_buffer1[0] == 'G' && rx_buffer1[1] == 'P'
						&& rx_buffer1[2] == 'R' && rx_buffer1[3] == 'M'
						&& rx_buffer1[4] == 'C') {

					process_gps_data();

				}
				del_buffer(gps);
			} else if (flag_system.start_rx_gps == 1) {
				rx_buffer1[rx_wr_index1] = data;
				if (++rx_wr_index1 > RX_BUFFER_SIZE1) {
					rx_wr_index1 = 0;
					flag_system.start_rx_gps = 0;

				}
//               if (++rx_counter1 == RX_BUFFER_SIZE1)
//                  {
//                  rx_counter1=0;
//                  rx_buffer_overflow1=1;
//                  };

			}

		}

	}
}

void TIMER0_IRQHandler(void) {
//
//    /* Set new timer interrupt, toggle led status and write value to the led port */
	uint8_t var_key, var_door,var_cold_hot;
	TIMER0_interrupt();
//	couter0++;
//	if (couter0 > 6) {
//		couter0 = 0;
//		toggle = ~toggle;
//		//GPIOSetValue(BUZZER, toggle);
//		//LPC_TIM0->IR = 1;			/* clear interrupt flag */
//	}

//    toggle = ~toggle;
//    GPIOSetValue(BUZZER, toggle);
//

	var_key = GPIOGetValue(KEY_IN);      //Read the button value
	var_door = GPIOGetValue(DOOR_IN);
	var_cold_hot = GPIOGetValue(COL_HOT);

	if (var_key == 0)      //KEY_IN
			{
		// GPIOSetValue(BUZZER, HIGH);
		flag_system.status_key = 1;
	} else {
		//GPIOSetValue(BUZZER, LOW);
		flag_system.status_key = 2;
	}
	if (var_door == 0)      //DOOR_IN
			{
		//GPIOSetValue(BUZZER, HIGH);
		flag_system.status_door = 1;
	} else {
		//GPIOSetValue(BUZZER, LOW);
		flag_system.status_door = 2;
	}
	if (var_cold_hot == 0)      //DOOR_IN
			{

		flag_system.cold_hot =1;
	} else {
		//GPIOSetValue(BUZZER, LOW);
		flag_system.cold_hot = 2;
	}

}

void TIMER1_IRQHandler(void) {
//
//    /* Set new timer interrupt, toggle led status and write value to the led port */
	TIMER1_interrupt();
	couter0++;
	if (couter0 > 6) {
		couter0 = 0;
		toggle = ~toggle;
		//GPIOSetValue(BUZZER, toggle);
		//LPC_TIM0->IR = 1;			/* clear interrupt flag */
	}
//	toggle = ~toggle;
//	GPIOSetValue(BUZZER, toggle);

//    toggle = ~toggle;
//    GPIOSetValue(BUZZER, toggle);
}

void EraseSectors() {
	if (u32IAP_EraseSectors(17, 17) == IAP_STA_CMD_SUCCESS) {
		UART3_PrintString("clear successful \r\n");
	} else {
		UART3_PrintString("clear unsuccessful \r\n");
	}
	if (u32IAP_PrepareSectors(17, 17) == IAP_STA_CMD_SUCCESS)
		UART3_PrintString("clear end \r\n");
}

//////END

void upload_info() {
	unsigned char x, j;
	//unsigned char phone_2[256];
	//memcpy(phone_2, (void*) 0x00018000, 256);
//	delay_ms(100);
//	for (x = 0; x < phoneLen; x++) {
//		if (phone_2[x] == NULL || phone_2[x] == 0xFF)
//			break;
//		if (phone_2[x] > 0x39 || phone_2[x] < 0x30)
//			break;
//		phone_1[x] = phone_2[x];
//	}
//	phone_1[x] = NULL;
//	if (phone_1[0] == NULL || phone_1[0] == 0xF)
//		sprintf(phone_1, "000");
////// start phoneDrive
//	for (j = 0; j < phoneLen; j++) {
//		if (phone_1[j] == NULL || phone_1[j] == 0xFF)
//			break;
//		phoneDrive[j] = phone_1[j];
//	}
//	phoneDrive[j] = NULL;
//	///end
	create_default_data;
	READ_APN_IP_SPEED();
	//delay_ms(1000);
	sprintf(apn, "%s", flash_data_APN_IP.apn_save);
	sprintf(userName, "%s", flash_data_APN_IP.userName_save);
	sprintf(passApn, "%s", flash_data_APN_IP.passWord_save);
	sprintf(ipServer, "%s", flash_data_APN_IP.ipServer_save);
	sprintf(tcpPort, "%s", flash_data_APN_IP.tcpPort_save);
	sprintf(passWord, "%s", flash_data_APN_IP.pass_save);
	speed_max = atoi(flash_data_APN_IP.speed_save);
	if (apn[0] == NULL || apn[0] == 0xff) {
//		sprintf(apn, "v-internet");
//		sprintf(userName, "");
//		sprintf(passApn, "");
		sprintf(apn, "m3-world");
		sprintf(userName, "mms");
		sprintf(passApn, "mms");
	}
	if (ipServer[0] == NULL || ipServer[0] == 0xff) {
		//sprintf(ipServer, "112.213.84.16");
		sprintf(ipServer,"112.213.84.16");
		//sprintf(ipServer, "112.213.94.122");

		sprintf(tcpPort, "11511");
	}
	if (timeCheck[0] == NULL || timeCheck[0] == 0xff)
		counter_send_gps = 15;		// gui len server
	flag_system.buzz_accept = 1;
}

void init_program(void) {
	TimerInit(0, TIMER0_INTERVAL);
	TimerInit(1, TIMER1_INTERVAL);
	enable_timer(0);
	enable_timer(1);
	if (SysTick_Config(SystemCoreClock / 1000)) //{ /* Setup SysTick Timer for 1 msec interrupts  */
			{
		while (1)
			; /* Capture error */
	}

	UART0_Init(9600);
	UART1_Init(9600);
	UART2_Init(9600);
	UART3_Init(9600);
	KHN_SDCARD_INIT();
//	LED_Init();
//	BUZZER_Init();
//	key_init();
//	door_init();
//	col_init();
//	gsm_on();
//	gps_init();
	GPIO_init();

