agrondpham/lpc1764-sdcard/KHNLPC1764/src/main.c
}
//int main(void) {
//	int x;
//	char* dataCollection;
//	char line[256]="Khanhhoi;0913742108;213432534435;324123412341;0946309067;0913742108;213432534435;324123412341;324123412341";
//	char* printData;
//	UART2_Init(9600);
//	UART2_PrintString("xxxx");
//	//dataCollection = strtok(line, ";");
//
//	get_data_from_flash(line);
//
//	UART2_PrintString(flash_data.company);
//	UART2_PrintString(flash_data.address);
//}

int main(void) {
	uint8_t buffer[200];

	uint8_t vitri, counter_init = 0, i;
	unsigned int couter_reset_gps =0;




	init_program();

	RTCInit();

//	alarm_time.RTC_Sec = 0;
//	alarm_time.RTC_Min = 0;
//	alarm_time.RTC_Hour = 0;
//	alarm_time.RTC_Mday = 1;
//	alarm_time.RTC_Wday = 0;
//	alarm_time.RTC_Yday = 1; /* alarm date 01/01/2007 */
//	alarm_time.RTC_Mon = 1;
//	alarm_time.RTC_Year = 2007;
//	RTCSetAlarm(alarm_time); /* set alarm time */

	NVIC_EnableIRQ(RTC_IRQn);


	GPIOSetValue(RES_GPS, HIGH);
	GPIOSetValue(GSM_RES, LOW);

	delay_ms(500);
	GPIOSetValue(RES_GPS, LOW);
	GPIOSetValue(GSM_RES, HIGH);
	upload_info();

	RTCStart();

	for (i = 0; i < 5; i++) {
		flash_led();
		//flash_gps();
		delay_ms(1000);
	}
	GPIOSetValue(BUZZER, HIGH);
	delay_ms(50);
	GPIOSetValue(BUZZER, LOW);
	flag_modem.flash_coppy = 1;
	flag_gprs.bit_data_flash_apn = 0;
	flag_gprs.bit_data_infor = 0;

	while (1) {
		//check SDCARD have default infor
		create_default_data();
		if (timer_check_sim900 >= counter_check_sim900)   // 10s kiem tra 1 lan
		{
			current_time = RTCGetTime();

			sprintf(time_gps, "%02d%02d%d,%02d%02d%02d",
					current_time.RTC_Mday, current_time.RTC_Mon,
					current_time.RTC_Year % 100, current_time.RTC_Hour,
					current_time.RTC_Min, current_time.RTC_Sec);
			start_up_gsm();
			timer_check_sim900 = 0;
			if (couter_reset_gps < 100)couter_reset_gps++;
			else
			{
				couter_reset_gps = 0;
				GPIOSetValue(RES_GPS, LOW);
				delay_ms(500);
				GPIOSetValue(RES_GPS, HIGH);
				delay_ms(1000);
				GPIOSetValue(RES_GPS, LOW);
				delay_ms(500);

			}
			//UART0_PrintString("AT+CMGR=1\r");
			flag_system.read_sms = 1;

		}
		if (flag_modem.modem == not_connect) {
			start_up_gsm();
			///if(flag_modem.flash_coppy == 1)
			//{
			//flag_modem.flash_coppy = 0;
			//CopyRAMToFlash(phone_1);
			//}
			delay_ms(1000);
			init_gsm();
			delay_ms(1000);
			///APN
			if (flag_modem.op_selec) {
				flag_modem.op_selec = 0;

				if (strcmp(Selection, viettel) == 0) {
					sprintf(apn, "v-internet");
					sprintf(userName, "");
					sprintf(passApn, "");
				} else if (strcmp(Selection, mobile) == 0
						|| strcmp(Selection, VN_mobile) == 0) {
					sprintf(apn, "m-wap");
					sprintf(userName, "mms");
					sprintf(passApn, "mms");
				} else if (strcmp(Selection, vina) == 0
						|| strcmp(Selection, VN_vina) == 0) {
					sprintf(apn, "m3-world");
					sprintf(userName, "mms");
					sprintf(passApn, "mms");
				} else {
					sprintf(apn, "m-wap");
					sprintf(userName, "mms");
					sprintf(passApn, "mms");
				}
			}

			///END
			if (flag_gprs.status_gprs != ok_status) {

				flag_system.led_check = 1;
				flag_gprs.status_gprs = init_tcp(apn, userName, passApn,
						flag_gprs.status_gprs);
				resend++;
				if (resend >= 2 && flag_gprs.status_gprs != ok_status) {
					flag_gprs.deactive_pdp = 1;
					resend = 0;
				} else if (flag_gprs.status_gprs == ok_status)
					counter_init = 0;
				flag_system.led_check = 0;
			}
		}
		if (flag_modem.modem == connected) {
			if (flag_modem.error == 1)
				flag_modem.modem = not_connect;
			else
				flag_modem.modem = connected;
			if (flag_system.read_sms == 1) {
				UART0_PrintString("AT+CMGR=1\r");
				flag_system.read_sms = 0;
				delay_ms(1000);			//}
				if (flag_modem.cmgr == 1) {
					flag_modem.cmgr = 0;
					//clearFlash();
					//EraseSectors();
					if (strlen(userCall_new) > 10)
						process_command();
					delay_ms(1000);
					UART0_PrintString("AT+CMGDA=\"DEL ALL\"\r");
					delay_ms(1000);
					send_sms_func(sms_reply);


					//delay_ms(1000);
					//UART0_PrintString("AT+CMGDA=\"DEL ALL\"\r");
					flag_system.send_data = 0;
					delay_ms(1000);
					//writeFlash(phone_1);
					if (strcmp(data_flash, ",,,,,,,,,\n\r") != 0) {
						if (flag_gprs.bit_data_infor == 1) {
							write_basic_infor(data_flash);
							flag_gprs.bit_data_infor = 0;
						}

					}
					if (strcmp(data_flash_APN, ",,,,,,,,,\n\r") != 0) {

						if (flash_data_APN_IP.userName_save == "") {
							strcpy(flash_data_APN_IP.userName_save, '0');//flash_data_APN_IP.userName_save  = "";
						}
						if (flash_data_APN_IP.passWord_save == "") {
							strcpy(flash_data_APN_IP.passWord_save, '0');
						}
						if (flag_gprs.bit_data_flash_apn == 1) {
							WRITE_APN_IP_SPEED(data_flash_APN);
							flag_gprs.bit_data_flash_apn = 0;
						}
					}

				}

				//CopyRAMToFlash(phone_1);
				delay_ms(500);
				//UART0_PrintString("AT\n\r");
				//delay_ms(1000);
				//flag_modem.modem = not_connect;
				//flag_modem.flash_coppy = 1;

			}
//			else if (flag_system.send_data_flag == smsMode) {
//				flag_system.send_data_flag = 0;
//				flag_system.send_data = 0;
//				send_sms_func(sms_reply);
//				delay_ms(1000);
//				UART0_PrintString("AT+CMGDA=\"DEL ALL\"\r");
//				delay_ms(3000);
//			}
			else if (flag_modem.ring) {
				ring_func();
//			for (i = 0; i < phoneLen; i++) {
//				if (phone_1[i] == NULL || phone_1[i] == 0xFF)
//					break;
//				phoneDrive[i] = phone_1[i];
//			}
//			phoneDrive[i] = NULL;

			}
			if (flag_system.buzz_accept) {
				if (atoi(speed_gps) * 1.852 >= speed_max
						&& flag_system.gps_detect) // vuot toc do  va co tin hieu GPS
						{
					if (atoi(speed_gps) < 80)
						GPIOSetValue(BUZZER, LOW);

					else {
						GPIOSetValue(BUZZER, HIGH);
						delay_ms(50);
						GPIOSetValue(BUZZER, LOW);
						delay_ms(50);
					}

