agrondpham/lpc1764-sdcard/KHNLPC1764/src/main.c
				}
			}
			if (flag_system.send_data || flag_system.change_status) {

				if (flag_gprs.deactive_pdp) {
					sprintf(buffer, "%c", ESC);
					UART0_PrintString(buffer);
					delay_ms(1000);
					UART0_PrintString("AT+CIPSHUT\r");
					delay_ms(1000);
					if (++counter_init >= 5)    // test
							{
						counter_init = 0;

						start_up_gsm();
						flag_modem.modem = not_connect;
					}
					flag_gprs.deactive_pdp = 0;
					flag_gprs.connect_ok = 0;
					flag_gprs.status_gprs = cstt_error;
				} else if (ipServer[0] != NULL
						&& ipServer[0] != 0xFF&& tcpPort[0] != NULL) // thieu xac nhan cac thong so
								{for (vitri = 0; vitri < strlen(imei); vitri++) // kiem tra thanh phan ky tu trong imei
						{             // dung tam bien vitri de lam bien dem
							if (imei[vitri] < 0x30 || imei[vitri] > 0x39) {
								if (check_imei() == 0) // check lai imei neu thay ok thi bat dau gui
								{
									vitri = 0;      // gan i = 0 de cho gui tiep
								} else
								vitri = 1;    // gan = 1 de stop gui
								break;
							}
						}
						if (vitri == 0 || vitri == strlen(imei)) // neu = 0 thi cho gui vi imei dung
						{

							if (connectServer(ipServer, tcpPort) == ok_status) {
								//if (connectServer(flash_data_APN_IP.ipServer_save,flash_data_APN_IP.tcpPort_save) == ok_status) {
								flag_gprs.connect_ok = 1;// ket noi ok



								if(read_basic_infor()==1 ||READ_APN_IP_SPEED()==1) {

								} else {
									UART3_PrintString("Co loi xay ra khi in\r\n");
									UART3_PrintString("Ma loi :  bsi-01\r\n");
								}
								if (strcmp(latitude, "_") == 0) {
									strcpy(latitude,"");
								}
								if (strcmp(longitude, "_") == 0) {
									strcpy(longitude,"");
								}
								memset(data_gps, gpsLen, NULL);// xoa NULL het GPS data
								sprintf(data_gps,
										"$$KHN$%s,%s,%s,%s,N,%s,E,%s,%d,%d,%d,%d,%s,%s,%d,%d,%s$\r\n",
										version,flash_data.id_device,
										imei,
										latitude,
										longitude,
										speed_gps, oil_value,
										flag_system.status_key,
										flag_system.status_door,
										flag_system.card_status,
										flash_data.vin_No,
										flash_data.phone,
										flag_system.cold_hot,
										flag_system.sleep,time_gps); //,gps_time_string);//gps_date_string,
								//gps_time_string);//time_gps_send);flag_system.sleep
								flag_gprs.send_gprs_ok =0;///it me
								if (send_data_gprs(data_gps) != ok_status)// send data
								{
									//UART2_PrintString("loi xay ra\r\n");
									flag_gprs.deactive_pdp = 1;// neu send bi loi thi reset lai gprs
								}
								//UART2_PrintString("Khong loi khi gui \r\n");
								delay_ms(1000);
								//if(flag_gprs.send_gprs_ok == 1)UART0_PrintString("AT+CIPSHUT\r");//it me
								//UART0_PrintString("AT+CIPCLOSE\r");

								//resend_gprs = 0;
								flag_gprs.connect_ok = 0;
							} else {
								flag_gprs.connect_ok = 0; // ket noi bi loi
								flag_gprs.deactive_pdp = 1;
							}
						}   // end cua vitri=0

					}

					flag_system.send_data = 0;
					flag_system.change_status = 0;

				}

			}

				/////// timer/////////////
		if (flag_system.write_data == 1) {

			if (flag_system.gps_detect) {
				if (strlen(gps_time_string) != 6
						|| strlen(gps_date_string) != 6) {
					UART3_PrintString("TIMER_ERROR\r");
					delay_ms(1000);
					goto exit_write_data;
				}
				khn_time_type datetime;

				datetime = convert_data_time(gps_date_string, gps_time_string,
						7);
				local_time.RTC_Sec = datetime.sec;
				local_time.RTC_Min = datetime.min;
				local_time.RTC_Hour = datetime.hour;
				local_time.RTC_Mday = datetime.day;
				//local_time.RTC_Wday = 03;
				//local_time.RTC_Yday = 12; /* current date 07/12/2006 */
				local_time.RTC_Mon = datetime.month;
				local_time.RTC_Year = datetime.year;
				RTCSetTime(local_time); /* Set local time */
				//sprintf(time_gps_card, "%02d%s%s", a, min_tam, sec_tam);

				memset(data_gps, sizeof(data_gps), NULL );
				//sprintf(data_gps, "AT+CCLK=\"%s+00\"\r", time_gps);
				//UART0_PrintString(data_gps);
				//UART2_PrintString(time_gps);
				delay_ms(500);
				// UART2_PrintString(time_gps);

			} else {
				//UART0_PrintString("at+cclk?\r");
				delay_ms(1000);
			}
//		                flag_system.status_door =! door;
//		                flag_system.status_key =! key;


			if (flag_system.cold_hot == "") {
				flag_system.cold_hot = "_";
			}
			if (flag_system.sleep == "") {
				flag_system.sleep = "_";
			}

			if (strcmp(flash_data.vin_No, "") == 0) {
				strcpy(flash_data.vin_No, "0");
			}
			if (strcmp(flash_data.phone, "") == 0) {
				strcpy(flash_data.phone, "0");
			}

			if (strcmp(latitude, "") == 0) {
				strcpy(latitude, "_");
			}
			if (strcmp(longitude, "") == 0) {
				strcpy(longitude, "_");
			}
			current_time = RTCGetTime();
			sprintf(day_gps_card, "%02d%02d%02d", current_time.RTC_Mday,
					current_time.RTC_Mon, current_time.RTC_Year % 100);
			sprintf(time_gps_card, "%02d%02d%02d", current_time.RTC_Hour,
					current_time.RTC_Min, current_time.RTC_Sec);
			memset(data_gps, sizeof(data_gps), NULL );
			sprintf(data_gps,
					"$%s,56,%s,%s,N,%s,E,%s,%d,%d,%d,%d,%s,%s,%d,%d,%s,%s\r\n",
					version, imei, latitude, longitude, speed_gps, oil_value,
					flag_system.status_key, flag_system.status_door,
					flag_system.card_status, flash_data.vin_No,
					flash_data.phone, flag_system.cold_hot, flag_system.sleep,
					day_gps_card, time_gps_card);			//flash_data.phone
//
//#if _DEBUG==1
//			UART2_PrintString(data_gps);
//#endif

			///start_sdcar
			switch (WriteData(1, atoi(day_gps_card),
					current_time.RTC_Hour * 10000)) {
			case 1:
				break;
			case 2:
				break;
			}
			if (f_puts(data_gps, &file) > -1) {
				Close();
				flag_system.card_status = 1;
#if _DEBUG==1
				UART3_PrintString("write sdcard\r\n");
#endif
			} else {
				flag_system.card_status = 0;
#if _DEBUG==1
				UART3_PrintString("CAN NOT Write sdcard\r\n");

#endif
			}  //END

			exit_write_data: flag_system.write_data = 0;
			timer_send_gps = 0; // xoa thoi gian gui len data va cho ghi vao the nho

			delay_ms(100);
		}
		//////////end////////

	}
}

